Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Overview of mental health and mental illness An overview of the mental health category, including links to documents on mental health services, community care, and the Mental Health Act 2001
ga: Overview Document Meabhairshláinte agus breoiteacht mheabhrach Forbhreathnú ar chatagóir mheabhairshláinte, lena n-áirítear naisc le doiciméid faoi theidlíocht, cúram pobail agus an tAcht Meabhair-Shláinte 2001

source: An outline of mental health services, treatment options, and a list of medical professionals involved in mental heath care
ga: Déanann an cháipéis seo cur síos ar na seirbhísí sláinte in Éirinn atá ar fáil do dhaoine atá ag fulaingt meabhairghalair

source: This document describes the roles and functions of mental health professionals
ga: Cur síos atá sa cháipéis seo faoi ról agus feidhmíocht proifisiúnaithe sláinte meabhrach

source: Admission to a psychiatric hospital
ga: Ospidéal síciatrach a iontráil

source: There are certain rules about voluntary and involuntary admissions to psychiatric hospitals and units
ga: Cur síos atá sa cháipéis seo ar na rialacha reatha a bhaineann le ligean isteach deonach agus neamhdheonach in ospidéil agus aonaid shíciatracha

source: Rights of psychiatric patients
ga: Cearta na n-othar síciatrach

source: Patients in psychiatric hospitals have important rights that are set down by law
ga: Bíonn cearta tábhachtacha ag na hothair in ospidéil síciatracha a leagtar síos de réir an dlí

source: Find out about these rights and how to appeal against detention
ga: Faigh amach faoi na cearta úd agus faoin gcaoi chun achomharc a thabhairt i gcoinne coinneála

source: The primary function of the Mental Health Commission is to ensure high standards in mental health services throughout the country
ga: Is í príomhfheidhm an Choimisiúin Meabhair-Shláinte caighdeáin arda a chinntiú i seirbhísí meabhair-shláinte ar fud na tíre

source: Inspector of Mental Health Services
ga: Cigirí na Seirbhísí Meabhair-Shláinte

source: This document describes the Inspector of Mental Health Services who is appointed under the Mental Health Act 2001
ga: Cur síos atá sa cháipéis seo faoi Chigire na Seirbhísí Meabhair- Shláinte a cheaptar faoin Acht Meabhair-Shláinte 2001

source: Mental Health Act 2001
ga: An tAcht Meabhair-Shláinte 2001

source: The Mental Health Act 2001 introduced important changes to rules about admission to psychiatric hospitals, monitoring and regulation of hospitals and legal rights of patients
ga: Thug an tAcht Meabhair-Shláinte 2001 isteach athruithe tábhachtach ar rialacha faoi ligean isteach chuig ospidéil shíciatracha, ar mhonatóireacht agus rialacháin ospidéil agus cearta dlíthiúla othar

source: Most Read in "Health"
ga: Ábhar is mó éilimh i "Sláinte"

source: Medical card means test: aged under 70
ga: Tástáil mhaoine cárta leighis: daoine faoi bhun 70 bliain d’aois
